# AttachChord Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..AttachChord Method
Truss Class See Also
---
Attach a truss's specific chord to a specified element, the element should be a roof or floor.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void AttachChord(
	Element attachToElement,
	TrussChordLocation location,
	bool forceRemoveSketch
)
```

Visual Basic
---
```text
Public Sub AttachChord ( _
	attachToElement As Element, _
	location As TrussChordLocation, _
	forceRemoveSketch As Boolean _
)
```

Visual C++
---
```text
public:
void AttachChord(
	Element^ attachToElement,
	TrussChordLocation location,
	bool forceRemoveSketch
)
```

# ### Parameters
attachToElement
    Type: Autodesk.Revit.DB..::..ElementThe element to which the truss's chord will attach. The element should be a roof or floor.
location
    Type: Autodesk.Revit.DB.Structure..::..TrussChordLocationThe chord need to be attached.
forceRemoveSketch
    Type: System..::..BooleanWhether to detach the original sketch if there is one.
# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace